ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_epwm_regs.xml
	<register id="DBCTL2" width="16" page="0" offset="0x1a" instances="1" instaddr="2" internal="0" description="Dead-Band Generator Control Register 2">
		<bitfield id="LOADDBCTLMODE" description="DBCTL Load from Shadow Mode Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SHDWDBCTLMODE" description="DBCTL Load mode Select" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="AQCTL" width="16" page="0" offset="0x20" instances="1" instaddr="2" internal="0" description="Action Qualifier Control Register">
		<bitfield id="LDAQAMODE" description="Action Qualifier A Load Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LDAQBMODE" description="Action Qualifier B Load Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="SHDWAQAMODE" description="Action Qualifer A Operating Mode" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SHDWAQBMODE" description="Action Qualifier B Operating Mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="LDAQASYNC" description="AQCTLA Register Load on SYNC" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="LDAQBSYNC" description="AQCTLB Register Load on SYNC" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="AQTSRCSEL" width="16" page="0" offset="0x22" instances="1" instaddr="2" internal="0" description="Action Qualifier Trigger Event Source Select Register">
		<bitfield id="T1SEL" description="T1 Event Source Select Bits" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="T2SEL" description="T2 Event Source Select Bits" begin="7" end="4" width="4" rwaccess="RW"/>
	</register>
	<register id="PCCTL" width="16" page="0" offset="0x28" instances="1" instaddr="2" internal="0" description="PWM Chopper Control Register">
		<bitfield id="CHPEN" description="PWM chopping enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OSHTWTH" description="One-shot pulse width" begin="4" end="1" width="4" rwaccess="RW"/>
		<bitfield id="CHPFREQ" description="Chopping clock frequency" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="CHPDUTY" description="Chopping clock Duty cycle" begin="10" end="8" width="3" rwaccess="RW"/>
	</register>
	<register id="VCAPCTL" width="16" page="0" offset="0x30" instances="1" instaddr="2" internal="0" description="Valley Capture Control Register">
		<bitfield id="VCAPE" description="Valley  Capture mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="VCAPSTART" description="Valley  Capture Start" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="Capture Trigger Select" begin="4" end="2" width="3" rwaccess="RW"/>
		<bitfield id="VDELAYDIV" description="Valley Delay Mode Divide Enable" begin="9" end="7" width="3" rwaccess="RW"/>
		<bitfield id="EDGEFILTDLYSEL" description="Valley Switching Mode Delay Select" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="VCNTCFG" width="16" page="0" offset="0x32" instances="1" instaddr="2" internal="0" description="Valley Counter Config Register">
		<bitfield id="STARTEDGE" description="Counter Start Edge Selection" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="STARTEDGESTS" description="Start Edge Status Bit " begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="STOPEDGE" description="Counter Start Edge Selection" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="STOPEDGESTS" description="Stop Edge Status Bit " begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="HRCNFG" width="16" page="0" offset="0x40" instances="1" instaddr="2" internal="0" description="HRPWM Configuration Register">
		<bitfield id="EDGMODE" description="ePWMxA Edge Mode Select Bits" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CTLMODE" description="ePWMxA Control Mode Select Bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="HRLOAD" description="ePWMxA Shadow Mode Select Bits" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SELOUTB" description="EPWMB Output Selection Bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="AUTOCONV" description="Autoconversion Bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SWAPAB" description="Swap EPWMA and EPWMB Outputs Bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EDGMODEB" description="ePWMxB Edge Mode Select Bits" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="CTLMODEB" description="ePWMxB Control Mode Select Bits" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="HRLOADB" description="ePWMxB Shadow Mode Select Bits" begin="12" end="11" width="2" rwaccess="RW"/>
	</register>
	<register id="HRCNFG2" width="16" page="0" offset="0x4e" instances="1" instaddr="2" internal="0" description="HRPWM Configuration 2 Register">
		<bitfield id="EDGMODEDB" description="Dead-Band Edge-Mode Select Bits" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CTLMODEDBRED" description="DBRED Control Mode Select Bits" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="CTLMODEDBFED" description="DBFED Control Mode Select Bits" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="HRPCTL" width="16" page="0" offset="0x5a" instances="1" instaddr="2" internal="0" description="High Resolution Period Control Register ">
		<bitfield id="HRPE" description="High Resolution Period Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PWMSYNCSEL" description="EPWMSYNCPER Source Select " begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TBPHSHRLOADE" description="TBPHSHR Load Enable " begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PWMSYNCSELX" description="EPWMSYNCPER Extended Source Select Bit: " begin="6" end="4" width="3" rwaccess="RW"/>
	</register>
	<register id="TRREM" width="16" page="0" offset="0x5c" instances="1" instaddr="2" internal="0" description="HRPWM High Resolution Remainder Register">
		<bitfield id="TRREM" description="HRPWM Remainder Bits" begin="10" end="0" width="11" rwaccess="RW"/>
	</register>
	<register id="GLDCTL" width="16" page="0" offset="0x68" instances="1" instaddr="2" internal="0" description="Global PWM Load Control Register">
		<bitfield id="GLD" description="Global Shadow to Active load event control" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GLDMODE" description="Shadow to Active Global Load Pulse Selection" begin="4" end="1" width="4" rwaccess="RW"/>
		<bitfield id="OSHTMODE" description="One Shot Load mode control bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GLDPRD" description="Global Load Strobe Period Select Register" begin="9" end="7" width="3" rwaccess="RW"/>
		<bitfield id="GLDCNT" description="Global Load Strobe Counter Register" begin="12" end="10" width="3" rwaccess="R"/>
	</register>
	<register id="GLDCFG" width="16" page="0" offset="0x6a" instances="1" instaddr="2" internal="0" description="Global PWM Load Config Register ">
		<bitfield id="TBPRD_TBPRDHR" description="Global load event configuration for TBPRD:TBPRDHR " begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPA_CMPAHR" description="Global load event configuration for CMPA:CMPAHR " begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPB_CMPBHR" description="Global load event configuration for CMPB:CMPBHR " begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPC" description="Global load event configuration for CMPC " begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPD" description="Global load event configuration for CMPD " begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DBRED_DBREDHR" description="Global load event configuration for DBRED:DBREDHR " begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DBFED_DBFEDHR" description="Global load event configuration for DBFED:DBFEDHR" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBCTL" description="Global load event configuration for DBCTL" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="AQCTLA_AQCTLA2" description="Global load event configuration for AQCTLA/A2 " begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="AQCTLB_AQCTLB2" description="Global load event configuration for AQCTLB/B2 " begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="AQCSFRC" description="Global load event configuration for AQCSFRC " begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="AQCTLA" width="16" page="0" offset="0x80" instances="1" instaddr="2" internal="0" description="Action Qualifier Control Register For Output A ">
		<bitfield id="ZRO" description="Action Counter = Zero" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="PRD" description="Action Counter = Period" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="CAU" description="Action Counter = Compare A Up" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="CAD" description="Action Counter = Compare A Down" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="CBU" description="Action Counter = Compare B Up" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="CBD" description="Action Counter = Compare B Down" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="AQCTLA2" width="16" page="0" offset="0x82" instances="1" instaddr="2" internal="0" description="Additional Action Qualifier Control Register For Output A ">
		<bitfield id="T1U" description="Action when event occurs on T1 in UP-Count" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="T1D" description="Action when event occurs on T1 in DOWN-Count" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="T2U" description="Action when event occurs on T2 in UP-Count" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="T2D" description="Action when event occurs on T2 in DOWN-Count" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
