ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_epwm_regs.xml
	<register id="TZOSTFLG" width="16" page="0" offset="0x12a" instances="1" instaddr="2" internal="0" description="Trip Zone OST Flag Register">
		<bitfield id="OST1" description="Latched Status Flag for OST1 Trip Latch" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="OST2" description="Latched Status Flag for OST2 Trip Latch" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="OST3" description="Latched Status Flag for OST3 Trip Latch" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="OST4" description="Latched Status Flag for OST4 Trip Latch" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="OST5" description="Latched Status Flag for OST5 Trip Latch" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="OST6" description="Latched Status Flag for OST6 Trip Latch" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="DCAEVT1" description="Latched Status Flag for Digital Compare Output A Event 1" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="DCBEVT1" description="Latched Status Flag for Digital Compare Output B Event 1" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CAPEVT" description="Capture Event Flag" begin="8" end="8" width="1" rwaccess="R"/>
	</register>
	<register id="TZCLR" width="16" page="0" offset="0x12e" instances="1" instaddr="2" internal="0" description="Trip Zone Clear Register">
		<bitfield id="INT" description="Global Interrupt Clear Flag" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CBC" description="Cycle-By-Cycle Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OST" description="One-Shot Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT1" description="DCAVET1 Flag Clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT2" description="DCAEVT2 Flag Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT1" description="DCBEVT1 Flag Clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT2" description="DCBEVT2 Flag Clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CAPEVT" description="Capture Event Clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CBCPULSE" description="Clear Pulse for CBC Trip Latch" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="TZCBCCLR" width="16" page="0" offset="0x130" instances="1" instaddr="2" internal="0" description="Trip Zone CBC Clear Register">
		<bitfield id="CBC1" description="Clear Flag for Cycle-By-Cycle (CBC1) Trip Latch" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CBC2" description="Clear Flag for Cycle-By-Cycle (CBC2) Trip Latch" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CBC3" description="Clear Flag for Cycle-By-Cycle (CBC3) Trip Latch" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CBC4" description="Clear Flag for Cycle-By-Cycle (CBC4) Trip Latch" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CBC5" description="Clear Flag for Cycle-By-Cycle (CBC5) Trip Latch" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CBC6" description="Clear Flag for Cycle-By-Cycle (CBC6) Trip Latch" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT2" description="Clear Flag forDCAEVT2 selected for CBC" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT2" description="Clear Flag for DCBEVT2 selected for CBC" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CAPEVT" description="Clear Flag for CAPEVT selected for CBC" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="TZOSTCLR" width="16" page="0" offset="0x132" instances="1" instaddr="2" internal="0" description="Trip Zone OST Clear Register">
		<bitfield id="OST1" description="Clear Flag for Oneshot (OST1) Trip Latch" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OST2" description="Clear Flag for Oneshot (OST2) Trip Latch" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OST3" description="Clear Flag for Oneshot (OST3) Trip Latch" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="OST4" description="Clear Flag for Oneshot (OST4) Trip Latch" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="OST5" description="Clear Flag for Oneshot (OST5) Trip Latch" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="OST6" description="Clear Flag for Oneshot (OST6) Trip Latch" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT1" description="Clear Flag for DCAEVT1 selected for OST" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT1" description="Clear Flag for DCBEVT1 selected for OST" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CAPEVT" description="Clear Flag for CAPEVT selected for OST" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="TZFRC" width="16" page="0" offset="0x136" instances="1" instaddr="2" internal="0" description="Trip Zone Force Register">
		<bitfield id="CBC" description="Force Trip Zones Cycle By Cycle Event" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OST" description="Force Trip Zones One Shot Event" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT1" description="Force Digital Compare A Event 1 " begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT2" description="Force Digital Compare A Event 2 " begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT1" description="Force Digital Compare B Event 1 " begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT2" description="Force Digital Compare B Event 2 " begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CAPEVT" description="Force Capture Event" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="TZTRIPOUTSEL" width="16" page="0" offset="0x13a" instances="1" instaddr="2" internal="0" description="Trip Zone Force Register">
		<bitfield id="OST" description="OST TRIPOUT select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CBC" description="CBC TRIPOUT select" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TZ1" description="TZ1 TRIPOUT select" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TZ2" description="TZ2 TRIPOUT select" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TZ3" description="TZ3 TRIPOUT select" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TZ4" description="TZ4 TRIPOUT select" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TZ5" description="TZ5 TRIPOUT select" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TZ6" description="TZ6 TRIPOUT select" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT1" description="DCAEVT1.force TRIPOUT select" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="DCAEVT2" description="DCAEVT2.force TRIPOUT select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT1" description="DCBEVT1.force TRIPOUT select" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="DCBEVT2" description="DCBEVT2.force TRIPOUT select" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CAPEVT" description="CAPEVT TRIPOUT select" begin="12" end="12" width="1" rwaccess="RW"/>
	</register>
	<register id="ETSEL" width="16" page="0" offset="0x148" instances="1" instaddr="2" internal="0" description="Event Trigger Selection Register">
		<bitfield id="INTSEL" description="EPWMxINTn Select" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="INTEN" description="EPWMxINTn Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SOCASELCMP" description="EPWMxSOCA Compare Select" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SOCBSELCMP" description="EPWMxSOCB Compare Select" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTSELCMP" description="EPWMxINT Compare Select" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SOCASEL" description="Start of Conversion A Select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="SOCAEN" description="Start of Conversion A Enable" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SOCBSEL" description="Start of Conversion B Select" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="SOCBEN" description="Start of Conversion B Enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ETPS" width="16" page="0" offset="0x14c" instances="1" instaddr="2" internal="0" description="Event Trigger Pre-Scale Register">
		<bitfield id="INTPRD" description="EPWMxINTn Period Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="INTCNT" description="EPWMxINTn Counter Register" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="INTPSSEL" description="EPWMxINTn Pre-Scale Selection Bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SOCPSSEL" description="EPWMxSOC A/B  Pre-Scale Selection Bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SOCAPRD" description="EPWMxSOCA Period Select" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="SOCACNT" description="EPWMxSOCA Counter Register" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="SOCBPRD" description="EPWMxSOCB Period Select" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="SOCBCNT" description="EPWMxSOCB Counter" begin="15" end="14" width="2" rwaccess="R"/>
	</register>
	<register id="ETFLG" width="16" page="0" offset="0x150" instances="1" instaddr="2" internal="0" description="Event Trigger Flag Register">
		<bitfield id="INT" description="EPWMxINTn Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SOCA" description="EPWMxSOCA Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SOCB" description="EPWMxSOCB Flag" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="ETCLR" width="16" page="0" offset="0x154" instances="1" instaddr="2" internal="0" description="Event Trigger Clear Register">
		<bitfield id="INT" description="EPWMxINTn Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SOCA" description="EPWMxSOCA Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SOCB" description="EPWMxSOCB Clear" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
