ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_epwm_regs.xml
	<register id="DCCAPMIXSEL" width="16" page="0" offset="0x19c" instances="1" instaddr="2" internal="0" description="Capture Event pulse select register">
		<bitfield id="ZRO" description="Zero match enable to DCCAPMIX" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PRD" description="Period match enable to DCCAPMIX" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CAU" description="CMPA up-count match enable to DCCAPMIX" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CAD" description="CMPA down-count match enable to DCCAPMIX" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CBU" description="CMPB up-count match enable to DCCAPMIX" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CBD" description="CMPB down-count match enable to DCCAPMIX" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CCU" description="CMPC up-count match enable to DCCAPMIX" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CCD" description="CMPC down-count match enable to DCCAPMIX" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CDU" description="CMPD up-count match enable to DCCAPMIX" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CDD" description="CMPD down-count match enable to DCCAPMIX" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="DCCAP" width="16" page="0" offset="0x19e" instances="1" instaddr="2" internal="0" description="Digital Compare Counter Capture Register ">
		<bitfield id="DCCAP" description="Time Base Counter Capture Register" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="DCAHTRIPSEL" width="16" page="0" offset="0x1a4" instances="1" instaddr="2" internal="0" description="Digital Compare AH Trip Select ">
		<bitfield id="TRIPINPUT1" description="Trip Input 1 Select to DCAH Mux" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT2" description="Trip Input 2 Select to DCAH Mux" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT3" description="Trip Input 3 Select to DCAH Mux" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT4" description="Trip Input 4 Select to DCAH Mux" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT5" description="Trip Input 5 Select to DCAH Mux" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT6" description="Trip Input 6 Select to DCAH Mux" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT7" description="Trip Input 7 Select to DCAH Mux" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT8" description="Trip Input 8 Select to DCAH Mux" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT9" description="Trip Input 9 Select to DCAH Mux" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT10" description="Trip Input 10 Select to DCAH Mux" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT11" description="Trip Input 11 Select to DCAH Mux" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT12" description="Trip Input 12 Select to DCAH Mux" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT14" description="Trip Input 14 Select to DCAH Mux" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT15" description="Trip Input 15 Select to DCAH Mux" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="DCALTRIPSEL" width="16" page="0" offset="0x1a6" instances="1" instaddr="2" internal="0" description="Digital Compare AL Trip Select ">
		<bitfield id="TRIPINPUT1" description="Trip Input 1 Select to DCAL Mux" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT2" description="Trip Input 2 Select to DCAL Mux" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT3" description="Trip Input 3 Select to DCAL Mux" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT4" description="Trip Input 4 Select to DCAL Mux" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT5" description="Trip Input 5 Select to DCAL Mux" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT6" description="Trip Input 6 Select to DCAL Mux" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT7" description="Trip Input 7 Select to DCAL Mux" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT8" description="Trip Input 8 Select to DCAL Mux" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT9" description="Trip Input 9 Select to DCAL Mux" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT10" description="Trip Input 10 Select to DCAL Mux" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT11" description="Trip Input 11 Select to DCAL Mux" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT12" description="Trip Input 12 Select to DCAL Mux" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT14" description="Trip Input 14 Select to DCAL Mux" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT15" description="Trip Input 15 Select to DCAL Mux" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="DCBHTRIPSEL" width="16" page="0" offset="0x1a8" instances="1" instaddr="2" internal="0" description="Digital Compare BH Trip Select ">
		<bitfield id="TRIPINPUT1" description="Trip Input 1 Select to DCBH Mux" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT2" description="Trip Input 2 Select to DCBH Mux" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT3" description="Trip Input 3 Select to DCBH Mux" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT4" description="Trip Input 4 Select to DCBH Mux" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT5" description="Trip Input 5 Select to DCBH Mux" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT6" description="Trip Input 6 Select to DCBH Mux" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT7" description="Trip Input 7 Select to DCBH Mux" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT8" description="Trip Input 8 Select to DCBH Mux" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT9" description="Trip Input 9 Select to DCBH Mux" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT10" description="Trip Input 10 Select to DCBH Mux" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT11" description="Trip Input 11 Select to DCBH Mux" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT12" description="Trip Input 12 Select to DCBH Mux" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT14" description="Trip Input 14 Select to DCBH Mux" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT15" description="Trip Input 15 Select to DCBH Mux" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="DCBLTRIPSEL" width="16" page="0" offset="0x1aa" instances="1" instaddr="2" internal="0" description="Digital Compare BL Trip Select ">
		<bitfield id="TRIPINPUT1" description="Trip Input 1 Select to DCBL Mux" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT2" description="Trip Input 2 Select to DCBL Mux" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT3" description="Trip Input 3 Select to DCBL Mux" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT4" description="Trip Input 4 Select to DCBL Mux" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT5" description="Trip Input 5 Select to DCBL Mux" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT6" description="Trip Input 6 Select to DCBL Mux" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT7" description="Trip Input 7 Select to DCBL Mux" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT8" description="Trip Input 8 Select to DCBL Mux" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT9" description="Trip Input 9 Select to DCBL Mux" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT10" description="Trip Input 10 Select to DCBL Mux" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT11" description="Trip Input 11 Select to DCBL Mux" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT12" description="Trip Input 12 Select to DCBL Mux" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT14" description="Trip Input 14 Select to DCBL Mux" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT15" description="Trip Input 15 Select to DCBL Mux" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CAPCTL" width="16" page="0" offset="0x1ac" instances="1" instaddr="2" internal="0" description="Event Capture Control Register">
		<bitfield id="SRCSEL" description="Capture Logic Input Selection " begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CAPGATEPOL" description="Polarity selection for Capture Gate input" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="CAPINPOL" description="Polarity selection for Capture input" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PULSECTL" description="Polarity selection for Capture input" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="FRCLOAD" description="Capture event force load" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="CAPGATETRIPSEL" width="16" page="0" offset="0x1ae" instances="1" instaddr="2" internal="0" description="Event Capture Gate Trip input select">
		<bitfield id="TRIPINPUT1" description="Trip Input 1 Select to CAPGATE Mux" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT2" description="Trip Input 2 Select to CAPGATE Mux" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT3" description="Trip Input 3 Select to CAPGATE Mux" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT4" description="Trip Input 4 Select to CAPGATE Mux" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT5" description="Trip Input 5 Select to CAPGATE Mux" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT6" description="Trip Input 6 Select to CAPGATE Mux" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT7" description="Trip Input 7 Select to CAPGATE Mux" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT8" description="Trip Input 8 Select to CAPGATE Mux" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT9" description="Trip Input 9 Select to CAPGATE Mux" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT10" description="Trip Input 10 Select to CAPGATE Mux" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT11" description="Trip Input 11 Select to CAPGATE Mux" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT12" description="Trip Input 12 Select to CAPGATE Mux" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT14" description="Trip Input 14 Select to CAPGATE Mux" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT15" description="Trip Input 15 Select to CAPGATE Mux" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CAPINTRIPSEL" width="16" page="0" offset="0x1b0" instances="1" instaddr="2" internal="0" description="Event Capture Trip input select">
		<bitfield id="TRIPINPUT1" description="Trip Input 1 Select to CAPIN Mux" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT2" description="Trip Input 2 Select to CAPIN Mux" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT3" description="Trip Input 3 Select to CAPIN Mux" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT4" description="Trip Input 4 Select to CAPIN Mux" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT5" description="Trip Input 5 Select to CAPIN Mux" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT6" description="Trip Input 6 Select to CAPIN Mux" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT7" description="Trip Input 7 Select to CAPIN Mux" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT8" description="Trip Input 8 Select to CAPIN Mux" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT9" description="Trip Input 9 Select to CAPIN Mux" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT10" description="Trip Input 10 Select to CAPIN Mux" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT11" description="Trip Input 11 Select to CAPIN Mux" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT12" description="Trip Input 12 Select to CAPIN Mux" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT14" description="Trip Input 14 Select to CAPIN Mux" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT15" description="Trip Input 15 Select to CAPIN Mux" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
