ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_epwm_regs.xml
	<register id="CAPTRIPSEL" width="16" page="0" offset="0x1b2" instances="1" instaddr="2" internal="0" description="Event Capture Signal Select">
		<bitfield id="CAPINCOMPSEL" description="CAPIN Comparator Input Select " begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="CAPGATECOMPSEL" description="CAPGATE Comparator COMP Input Select " begin="7" end="4" width="4" rwaccess="RW"/>
	</register>
	<register id="EPWMLOCK" width="32" page="0" offset="0x1f4" instances="1" instaddr="4" internal="0" description="EPWM Lock Register">
		<bitfield id="HRLOCK" description="HRPWM Register Set Lock" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GLLOCK" description="Global Load Register Set Lock" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TZCFGLOCK" description="TripZone Register Set Lock" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TZCLRLOCK" description="TripZone Clear Register Set Lock" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DCLOCK" description="Digital Compare Register Set Lock" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key to write to this register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="HWVDELVAL" width="16" page="0" offset="0x1fa" instances="1" instaddr="2" internal="0" description="Hardware Valley Mode Delay Register">
		<bitfield id="HWVDELVAL" description="Hardware programmed Valley Delay Value" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="VCNTVAL" width="16" page="0" offset="0x1fc" instances="1" instaddr="2" internal="0" description="Hardware Valley Counter Register">
		<bitfield id="VCNTVAL" description="Valley Counter Value" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
</module>
